InformationRegisters/АдресаМаршрутовДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>АдресаМаршрутовДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУлиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачальныйДом</Name>
					<Comment>Начальный дом во внутреннем формате</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечныйДом</Name>
					<Comment>Конечный дом во внутреннем формате</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресаМаршрутовДоставки/Ext/ManagerModule.bsl
Процедура ПолучитьНастройкиМаршрутаДоставки(Ссылка, Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КлассификаторУлиц.Ссылка КАК Ссылка,
	                      |	ЛОЖЬ КАК Актуальность,
	                      |	NULL КАК Представление,
	                      |	ЛОЖЬ КАК ТолькоПросмотр,
	                      |	ВЫБОР
	                      |		КОГДА КлассификаторУлиц.ЭтоГруппа
	                      |			ТОГДА 2
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ + ВЫБОР
	                      |		КОГДА КлассификаторУлиц.ПометкаУдаления
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК ИндексКартинки
	                      |ИЗ
	                      |	Справочник.КлассификаторУлиц КАК КлассификаторУлиц
	                      |ГДЕ
	                      |	НЕ КлассификаторУлиц.ЭтоГруппа
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КлассификаторУлиц.Владелец.Наименование,
	                      |	КлассификаторУлиц.Наименование
	                      |ИТОГИ
	                      |	КлассификаторУлиц.Владелец КАК Ссылка,
	                      |	ИСТИНА КАК ТолькоПросмотр,
	                      |	2 КАК ИндексКартинки
	                      |ПО
	                      |	КлассификаторУлиц.Владелец
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Владелец", Ссылка.Ссылка);
	
	НастройкиМаршрутаДоставки = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	НастройкиМаршрутаДоставки.Колонки.Добавить("СписокНомеровДомов", Новый ОписаниеТипов("СписокЗначений"));
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АдресаМаршрутовДоставки.Улица КАК Улица,
	                      |	АдресаМаршрутовДоставки.Представление,
	                      |	АдресаМаршрутовДоставки.НачальныйДом КАК НачальныйДом,
	                      |	АдресаМаршрутовДоставки.КонечныйДом КАК КонечныйДом
	                      |ИЗ
	                      |	РегистрСведений.АдресаМаршрутовДоставки КАК АдресаМаршрутовДоставки
	                      |ГДЕ
	                      |	АдресаМаршрутовДоставки.МаршрутДоставки = &Владелец
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Улица,
	                      |	НачальныйДом,
	                      |	КонечныйДом");
	Запрос.УстановитьПараметр("Владелец", Ссылка.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = НастройкиМаршрутаДоставки.Строки.Найти(Выборка.Улица, "Ссылка", Истина);	
		Если (СтрокаТаблицы = Неопределено) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Актуальность = Истина;
		Если (УправлениеКонтактнойИнформацией.ПолучитьПредставлениеДомаВнутреннее("1") = Выборка.НачальныйДом) И (УправлениеКонтактнойИнформацией.ПолучитьПредставлениеДомаВнутреннее(Неопределено) = Выборка.КонечныйДом) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы.СписокНомеровДомов.Добавить(Новый Структура("НачальныйДом,КонечныйДом,Представление", Выборка.НачальныйДом,Выборка.КонечныйДом,Выборка.Представление), Выборка.Представление);
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(НастройкиМаршрутаДоставки, Объект);	

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПолучитьНастройкиМаршрутаДоставки()

Процедура УстановитьНастройкиМаршрутаДоставки(Ссылка, Объект, Отказ) Экспорт

	Если Не Отказ Тогда

		УстановитьПривилегированныйРежим(Истина);
		
		НастройкиМаршрутаДоставки = ДанныеФормыВЗначение(Объект, Тип("ДеревоЗначений"));
		
		НаборЗаписей = РегистрыСведений.АдресаМаршрутовДоставки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.МаршрутДоставки.Установить(Ссылка.Ссылка);
		
		Ресторан = Ссылка.Владелец;
		
		// Актуальные.
		Для Каждого СтрокаНастройкиМаршрутаДоставки Из НастройкиМаршрутаДоставки.Строки.НайтиСтроки(Новый Структура("Актуальность,ТолькоПросмотр", Истина, Ложь), Истина) Цикл 
			Если СтрокаНастройкиМаршрутаДоставки.СписокНомеровДомов.Количество() Тогда
				Для Каждого Значение Из СтрокаНастройкиМаршрутаДоставки.СписокНомеровДомов Цикл 
					Значение = Значение.Значение;	// Наепка - друг чекиста ;)
					
					Запись = НаборЗаписей.Добавить();
					Запись.МаршрутДоставки = Ссылка.Ссылка;
					Запись.Ресторан = Ресторан;
					Запись.Улица = СтрокаНастройкиМаршрутаДоставки.Ссылка;
					Запись.НачальныйДом = Значение.НачальныйДом;
					Запись.КонечныйДом = Значение.КонечныйДом;
					Запись.Представление = Значение.Представление;
				КонецЦикла;
			Иначе
				Запись = НаборЗаписей.Добавить();
				Запись.Ресторан = Ресторан;
				Запись.МаршрутДоставки = Ссылка.Ссылка;
				Запись.Улица = СтрокаНастройкиМаршрутаДоставки.Ссылка;
				Запись.НачальныйДом = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеДомаВнутреннее("1");
				Запись.КонечныйДом = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеДомаВнутреннее(Неопределено);
				Запись.Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеДома("1") + " — " + УправлениеКонтактнойИнформацией.ПолучитьПредставлениеДома(Неопределено);
			КонецЕсли;
		КонецЦикла; 

		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			// TODO: Регистрация ошибки.
			__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Не удалось изменить адреса маршрута доставки'; uk = 'Не вдалося змінити адреси маршруту доставки'"), ,, "ПравилаИспользования", Отказ);
		КонецПопытки;

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьНастройкиПользователей()
